Revit 2026 API

# CurveElementSetSketchPlaneAndCurve Method

---

Sets the sketch plane and the curve for this CurveElement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSketchPlaneAndCurve(
	SketchPlane sketchPlane,
	Curve curve
)
```
```vb
Public Sub SetSketchPlaneAndCurve (
	sketchPlane As SketchPlane,
	curve As Curve
)
```
```cpp
public:
void SetSketchPlaneAndCurve(
	SketchPlane^ sketchPlane,
	Curve^ curve
)
```
```fsharp
member SetSketchPlaneAndCurve :
        sketchPlane : SketchPlane *
        curve : Curve -> unit
```

#### Parameters

sketchPlane SketchPlane
    The new sketch plane.
curve Curve
    The new curve.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown if the argument is . |
| InvalidOperationException | Thrown if the CurveElement is CurveByPoints or belongs to a Path3d element. -- or -- Thrown if the sketch plane is set on a DetailCurve. -- or -- Thrown if the sketch plane is not suitable. -- or -- Thrown if the CurveElement belongs to a sketch-based element. -- or -- Thrown if modifying the sketch plane is not allowed. -- or -- Thrown if the CurveElement cannot be moved out of its sketch plane. -- or -- Thrown if the input curve is of a type different from the current. -- or -- Thrown if the input curve is bound and the current is not or vice versa. -- or -- Thrown if the input curve is helical. -- or -- Thrown if the input curve lies outside of the SketchPlane of the current curve. |

Unlike the setters of SketchPlane and GeometryCurve, this method will reset relationships between the two properties and with other elements. To set a geometry curve which belongs to a sketch-based elements, use GeometryCurve

#### Reference

CurveElement Class

Autodesk.Revit.DB Namespace